Autodesk.Revit.DB.Electrical.LoadClassification
An enumerated type to list all demand factor classifications.

Autodesk.Revit.DB.Electrical.LoadClassification.Hvac
Load classification is HVAC.

Autodesk.Revit.DB.Electrical.LoadClassification.Lighting
Load classification is Lighting.

Autodesk.Revit.DB.Electrical.LoadClassification.Power
Load classification is power.

Autodesk.Revit.DB.Electrical.LoadClassification.Undefined
Load classification is undefined.